Autodesk.Revit.DB.BoundingBoxXYZ.Enabled
Defines whether the entire bounding box is enabled.
Remarks: A disabled bounding box might be used to signal that the corresponding Revit functionality
is deactivated.  For example, a disabled 3D view section box represents an inactive section box.

Autodesk.Revit.DB.BoundingBoxXYZ.BoundEnabled(System.Int32,System.Int32)
Indexed access for loops.
Remarks: For bound, use 0 for Min and 1 for Max. For dimension, use 0 for X, 1 for
Y and 2 for Z.
The entire box must be enabled to have enabled individual bounds.

Autodesk.Revit.DB.BoundingBoxXYZ.MaxEnabled(System.Int32)
Defines whether the maximum bound is active for given dimension.
Remarks: Use 0 for X, 1 for Y and 2 for Z.
The entire box must be enabled to have enabled individual bounds.

Autodesk.Revit.DB.BoundingBoxXYZ.MinEnabled(System.Int32)
Defines whether the minimum bound is active for given dimension.
Remarks: Use 0 for X, 1 for Y and 2 for Z.
The entire box must be enabled to have enabled individual bounds.

Autodesk.Revit.DB.BoundingBoxXYZ.Bounds(System.Int32)
Indexed access for loops. Use 0 for Min and 1 for Max.
Remarks: The bounds are defined in the coordinate space of the box.

Autodesk.Revit.DB.BoundingBoxXYZ.Max
Maximum coordinates (upper-right-front corner of the box).
Remarks: The bounds are defined in the coordinate space of the box.

Autodesk.Revit.DB.BoundingBoxXYZ.Min
Minimum coordinates (lower-left-rear corner of the box).
Remarks: The bounds are defined in the coordinate space of the box.

Autodesk.Revit.DB.BoundingBoxXYZ.Transform
The transform from the coordinate space of the box to the model coordinate space.
Remarks: The transform must always be right-handed and orthonormal.

Autodesk.Revit.DB.BoundingBoxXYZ.#ctor
Constructs a new BoundingBoxXYZ with a default transform and extents of (-100, -100, -100) to (100, 100, 100).

Autodesk.Revit.DB.BoundingBoxXYZ
A three-dimensional rectangular box at an arbitrary location and orientation within the Revit model.
Remarks:
BoundingBoxXYZ objects are used in Revit in several places related to views (for example, the section box of a
3D view or the definition of a section or detail view).  BoundingBoxXYZ objects can also be obtained from elements representing the
boundary of the element in a given view.
The extents of the box are determined by three orthogonal planes extended through the minimum (Autodesk.Revit.DB.BoundingBoxXYZ.Min)
and maximum (Autodesk.Revit.DB.BoundingBoxXYZ.Max) points, but the coordinates of these points and the orientation of the planes
in relation to the coordinates of the source model is determined by the box Transform (Autodesk.Revit.DB.BoundingBoxXYZ.Transform).
This class also has the ability to detect and mark certain extents as disabled.  Note that in the current Revit API uses
of this class it is not expected that Revit will give objects with disabled extents, and disabled extents in objects
sent to Revit will likely be ignored.